Revit 2027 API
ParameterTypeId.ViewSolarstudyLightingAltitudeValue Property
 "Lighting altitude"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId ViewSolarstudyLightingAltitudeValue { get; }
Public Shared ReadOnly Property ViewSolarstudyLightingAltitudeValue As ForgeTypeId
	Get
public:
static property ForgeTypeId^ ViewSolarstudyLightingAltitudeValue {
	ForgeTypeId^ get ();
}
static member ViewSolarstudyLightingAltitudeValue : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace